# DekanewtonMeters Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..DekanewtonMeters Property
UnitTypeId Class See Also
---
Dekanewton meters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DekanewtonMeters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DekanewtonMeters As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DekanewtonMeters {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace